// Практическая работа №4
// Задача 30(4). выводит массив из 8 элементов, заполненный нулями и единицами в случайном порядке
Console.Clear();

int[] array = new int[10];                      // задали массив целого типа с названием array из -8- целых чисел по 32_бита на число
for (int i=0;i<array.Length;i++)                // зацикливаем при условии (i < длины массива)
{
    array[i] = new Random().Next(0,2);          // присваиваем случайное число от 0 до 1 элементу(ам) массива
}
Console.WriteLine(string.Join("," , array));    // Метод с исп-м Join для вывода массива. Позволяет собрать из массива строчку!