// Доп. задание
// Написать метод для разворота массива, не используя память под дополнительный массив
Console.Clear();
int[] array = {3, 7, 9, 5,11};
for (int i = array.Length - 1; i >=0; i--)
{
    Console.Write(array[i]);
}