// Практическая работа №4
// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Данные вводятся с консоли пользователем
Console.Clear();

int GiveMeNumbersOfArray(int numbers)
{
    Console.Write("Введите число и нажмите Enter(ввод)");
    Convert.ToInt32(Console.ReadLine());
}