// Практическая работа №4
// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Данные вводятся с консоли пользователем
Console.Clear();

int GiveMeCount(string Numbers)
{
    Console.Write(Numbers);
    return Convert.ToInt32(Console.ReadLine());
// }
// for(int i=;i)
// int N = GiveMeCount("Введите число и нажмите ввод (ENTER): ");