// Практическое задание №3
// Задача №17. Напишите программу, которая принимает на вход координаты точки (X и Y), 
// причем X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.
Console.Clear();
Console.WriteLine("Введите координату X");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координату Y");
int y = Convert.ToInt32(Console.ReadLine());

if (x == 0 || y == 0)
{
    Console.WriteLine("Введите координаты отличные от нуля");
}

if (x > 0 && y > 0)
{
    Console.WriteLine($"Введены координаты x={x}; y={y}, которые относятся к первой четверти системы координат");
}

if (x < 0 && y > 0)
{
    Console.WriteLine($"Введены координаты x={x}; y={y}, которые относятся ко второй четверти системы координат");
}

if (x < 0 && y < 0)
{
    Console.WriteLine($"Введены координаты x={x}; y={y}, которые относятся к третьей четверти системы координат");
}

if (x > 0 && y < 0)
{
    Console.WriteLine($"Введены координаты x={x}; y={y}, которые относятся к четвертой четверти системы координат");
}