// Практическое заданме №2
// Задача 9(2). Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.
// 78 -> 8
// 12-> 2
// 85 -> 8

Console.Clear();
int number = new Random().Next(10, 100); // Для вывода случайных целых чисел в интервале от 10 - 99 включительно
int digit2 = number % 10;       // Вывести 2-е число, необходимо десятичное число поделить на 10 и взять остаток
int digit1 = number / 10;       // Делим на 10 двухзначное число и сразу получим 1-ю цифру, т.к. тип int

Console.WriteLine($"Случайное число {number}, первая цифра = {digit1}, вторая цифра = {digit2}"); // Знак $ позволяет сразу же указать переменные в более простой форме для вывода

int max = digit2;
if (digit1 > max)
{
    max = digit1;
    Console.WriteLine($"Максимальное из чисел первое {max}");
}
// if (digit1 == digit2)
// {
//     Console.WriteLine("Оба числа равны!");
// }
else
{
    max = digit2;
    Console.WriteLine($"Максимальное из чисел второе {max}");
}