// Практическое заданме №2
//Задача 13(2): Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6
// до 8 знаков через ЦИКЛ 

// при выполнении условия number >= 1000, выполняется итерация number/10
// по сути данное условие, будет каждый круг крутить число 1000000 и делить его на 10 до тех пор, пока оно не станет трехзначным,
// и тогда уже выполнится вывод на экран это число % 10, то бишь 3 - е число)

// в цикле, на случай, если оно будет не двухзначным как в if, а наоборот 4 и более значным, в таких случаях и будем использовать цикл, 
//чтобы каждый раз его уменьшать на одну длинну, грубо говоря сперва ввели 10 000, цикл его поделит на 10 и оно станет уже 1 000, 
//цикл его проверяет оно все еще >= 1000, тогда он еще раз его поделит на 10, получится 100, цикл проверит, что число больше не 
//подходит под условия и пропустит его дальше, а дальше строка вывода в консоль, в которой есть условие что 
//выводится данное число но %(с отделением последнего числа, то бить от 100 третье число будет 0, он и выведет число 0)
//  счетчик не надо ставить, просто (; num>= 1000; num = num/10)
Console.Clear();
Console.WriteLine("Введите любое число ");
int number = Convert.ToInt32(Console.ReadLine());// Преобразовываем в целое(int) и помещаем в переменную

if (number < 100)
{
    Console.WriteLine("Третьей цифры нет!");
}
else
{
    for (; number >= 1000; number = number / 10) ;
    {
        int dig = number % 10;
        Console.WriteLine($"третья цифра заданного числа = {dig}");
    }
}