// Практическое задание №6
// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// Ввод чисел останавливается при помощи ввода слова "stop"
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 4
Console.Clear();

int counts = 0;

while (true)
{
    string enterCount = Console.ReadLine();
    if (enterCount  == "stop") 
    {
        break;
    }
    else
    {
        double.TryParse(enterCount, out double answerNumber);       // Преобразует представление числа в виде диапазона в формате,
        if (answerNumber > 0)                                       // соответствующем стилю. Ключевое out инициирует передачу аргументов по ссылке. 
        {                                                           // В результате этот формальный параметр становится псевдонимом 
            counts++;                                               // для аргумента, который должен представлять собой переменную.
        }
    }
}
Console.Write(counts);