// Задача 18: Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
Console.Clear();
Console.WriteLine("Введите номер четверти 1,2,3 или 4");
int a = Convert.ToInt32(Console.ReadLine());

if (4 < a || a <= 0)
{
    Console.WriteLine("Пожалуйста, Укажите правильно номер четверти 1,2,3 или 4");
}

if (a == 1)
{
    Console.WriteLine("Координаты 1-й четверти принадлежат значениям с X > 0; Y > 0");
}

if (a == 2)
{
    Console.WriteLine("Координаты 2-й четверти принадлежат значениям X < 0; Y > 0");
}

if (a == 3)
{
    Console.WriteLine("Координаты 3-й четверти принадлежат значениям X < 0; Y < 0");
}

if (a == 4)
{
    Console.WriteLine("Координаты 4-й четверти принадлежат значениям X > 0; Y < 0");
}