// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет
Console.Clear();
Console.WriteLine("Введите число от 1 до 7");
int N = Convert.ToInt32(Console.ReadLine());
if (N==6)
{
    Console.WriteLine($"Поздравляю Вас! Сегодня выходной день!");
}
if (N==7)
{
    Console.WriteLine($"Поздравляю Вас! Сегодня выходной день!");
}
else if (N <= 5)
{
    Console.WriteLine($"День под номером {N} - является рабочим днем, держитесь!)");
}
if (8 <= N)
{
    Console.WriteLine("В днях недели на планете Земля, такой нумерации нет");
}