/* // Практическое заданме №1
Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
3 -> Среда
5 -> Пятница*/
Console.Clear();
Console.Write("Введите номер от 1 до 7 и я дам название дня недели  ");
int number = Convert.ToInt32(Console.ReadLine());
if (number == 1)
Console.Write("Понедельник - день тяжелый...");
if (number == 2)
Console.Write("Вторник - Отличный день для продолжения дел начатых в понедельник!");
if (number == 3)
Console.Write("Среда - Уже середина недели!");
if (number == 4)
Console.Write("Четверг - Пора бы поторопиться с делами, завтра конец рабочей недели!");
if (number == 5)
Console.Write("Пятница - Отличный день, конечно если успел с делами");
if (number == 6)
Console.Write("Суббота - Моожно подольше поспать, если закончил с делами в пятницу");
if (number == 7)
Console.Write("Воскресенье - Брось все дела! Отдохни часок-другой!");