// Практическое заданме №2
// Задача 9. Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.
// Например:
// 78 -> 8
// 12-> 2
// 85 -> 8
int q = new Random().Next(10, 100);
Console.WriteLine();
