// Практическое задание №1
// Задача 6: Напишите программу, которая на вход принимает число и выдает, является ли число четным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет
Console.Clear();
Console.WriteLine("Введите число ");
double N = Convert.ToInt32(Console.ReadLine());
double n = N % 2;
if (n == 0)
{
    Console.WriteLine($"Число {N} кратно 2-м, а соответственно является четным.");
    Console.Write($"Остаток от деления на 2 = {n}");
}
else
{
    Console.WriteLine("Число не кратно 2-м и не является четным");
    Console.Write($"Остаток от деления на 2 = {n}");
}