// Практическое задание №6
// Задача 40: Напишите программу, которая принимает на вход три числа и проверяет,
// может ли существовать треугольник с сторонами такой длины.
// "Теорема о неравенстве треугольника: каждая сторона треугольника меньше суммы двух других сторон."
Console.Clear();

int ReadInt(string message)                         // Создали метод для вывода на экран и получения числа (c 7-11 строку)
{
    Console.WriteLine(message);
    return Convert.ToInt32(Console.ReadLine());     // От пользователя ответ прочитали, сконвертировали и сразу  отдали
}

int A = ReadInt("Введите сторону A: ");
int B = ReadInt("Введите сторону B: ");
int C = ReadInt("Введите сторону C: ");

if (A + B > C && A + C > B && C + B > A)
{
    Console.WriteLine("Треугольник может существовать со сторонами такой длины.");
}
else
{
    Console.WriteLine("Не может");
}