// Практическое заданме №2
// Задача 10(2): Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1
Console.Clear();
Console.WriteLine("Введите трехзначное число");
int N = Convert.ToInt32(Console.ReadLine());
int N2 = N / 10;
int N3 = N2 % 10;
Console.WriteLine($" {N3} ");